Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_mdf equates.
 */
#pragma once

#include    <stdint.h>

// MDF address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    GCR;
    volatile    uint32_t    CKGCR;
    volatile    uint32_t    RESERVED0[6];
    volatile    uint32_t    TRGISELR;
    volatile    uint32_t    RESERVED1[23];
    volatile    uint32_t    SITF0CR;
    volatile    uint32_t    BSMX0CR;
    volatile    uint32_t    DFLT0CR;
    volatile    uint32_t    DFLT0CICR;
    volatile    uint32_t    DFLT0RSFR;
    volatile    uint32_t    DFLT0INTR;
    volatile    uint32_t    OLD0CR;
    volatile    uint32_t    OLD0THLR;
    volatile    uint32_t    OLD0THHR;
    volatile    uint32_t    DLY0CR;
    volatile    uint32_t    SCD0CR;
    volatile    uint32_t    DFLT0IER;
    volatile    uint32_t    DFLT0ISR;
    volatile    uint32_t    OEC0CR;
    volatile    uint32_t    RESERVED2[13];
    volatile    uint32_t    SNPS0DR;
    volatile    uint32_t    DFLT0DR;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    SITF1CR;
    volatile    uint32_t    BSMX1CR;
    volatile    uint32_t    DFLT1CR;
    volatile    uint32_t    DFLT1CICR;
    volatile    uint32_t    DFLT1RSFR;
    volatile    uint32_t    DFLT1INTR;
    volatile    uint32_t    OLD1CR;
    volatile    uint32_t    OLD1THLR;
    volatile    uint32_t    OLD1THHR;
    volatile    uint32_t    DLY1CR;
    volatile    uint32_t    SCD1CR;
    volatile    uint32_t    DFLT1IER;
    volatile    uint32_t    DFLT1ISR;
    volatile    uint32_t    OEC1CR;
    volatile    uint32_t    RESERVED4[13];
    volatile    uint32_t    SNPS1DR;
    volatile    uint32_t    DFLT1DR;
    volatile    uint32_t    RESERVED5[3];
    volatile    uint32_t    SITF2CR;
    volatile    uint32_t    BSMX2CR;
    volatile    uint32_t    DFLT2CR;
    volatile    uint32_t    DFLT2CICR;
    volatile    uint32_t    DFLT2RSFR;
    volatile    uint32_t    DFLT2INTR;
    volatile    uint32_t    OLD2CR;
    volatile    uint32_t    OLD2THLR;
    volatile    uint32_t    OLD2THHR;
    volatile    uint32_t    DLY2CR;
    volatile    uint32_t    SCD2CR;
    volatile    uint32_t    DFLT2IER;
    volatile    uint32_t    DFLT2ISR;
    volatile    uint32_t    OEC2CR;
    volatile    uint32_t    RESERVED6[13];
    volatile    uint32_t    SNPS2DR;
    volatile    uint32_t    DFLT2DR;
    volatile    uint32_t    RESERVED7[3];
    volatile    uint32_t    SITF3CR;
    volatile    uint32_t    BSMX3CR;
    volatile    uint32_t    DFLT3CR;
    volatile    uint32_t    DFLT3CICR;
    volatile    uint32_t    DFLT3RSFR;
    volatile    uint32_t    DFLT3INTR;
    volatile    uint32_t    OLD3CR;
    volatile    uint32_t    OLD3THLR;
    volatile    uint32_t    OLD3THHR;
    volatile    uint32_t    DLY3CR;
    volatile    uint32_t    SCD3CR;
    volatile    uint32_t    DFLT3IER;
    volatile    uint32_t    DFLT3ISR;
    volatile    uint32_t    OEC3CR;
    volatile    uint32_t    RESERVED8[13];
    volatile    uint32_t    SNPS3DR;
    volatile    uint32_t    DFLT3DR;
    volatile    uint32_t    RESERVED9[3];
    volatile    uint32_t    SITF4CR;
    volatile    uint32_t    BSMX4CR;
    volatile    uint32_t    DFLT4CR;
    volatile    uint32_t    DFLT4CICR;
    volatile    uint32_t    DFLT4RSFR;
    volatile    uint32_t    DFLT4INTR;
    volatile    uint32_t    OLD4CR;
    volatile    uint32_t    OLD4THLR;
    volatile    uint32_t    OLD4THHR;
    volatile    uint32_t    DLY4CR;
    volatile    uint32_t    SCD4CR;
    volatile    uint32_t    DFLT4IER;
    volatile    uint32_t    DFLT4ISR;
    volatile    uint32_t    OEC4CR;
    volatile    uint32_t    RESERVED10[13];
    volatile    uint32_t    SNPS4DR;
    volatile    uint32_t    DFLT4DR;
    volatile    uint32_t    RESERVED11[3];
    volatile    uint32_t    SITF5CR;
    volatile    uint32_t    BSMX5CR;
    volatile    uint32_t    DFLT5CR;
    volatile    uint32_t    DFLT5CICR;
    volatile    uint32_t    DFLT5RSFR;
    volatile    uint32_t    DFLT5INTR;
    volatile    uint32_t    OLD5CR;
    volatile    uint32_t    OLD5THLR;
    volatile    uint32_t    OLD5THHR;
    volatile    uint32_t    DLY5CR;
    volatile    uint32_t    SCD5CR;
    volatile    uint32_t    DFLT5IER;
    volatile    uint32_t    DFLT5ISR;
    volatile    uint32_t    OEC5CR;
    volatile    uint32_t    RESERVED12[13];
    volatile    uint32_t    SNPS5DR;
    volatile    uint32_t    DFLT5DR;
} MDF_TypeDef;

#if (defined(__cplusplus))
#define MDF_NS  reinterpret_cast<MDF_TypeDef *>(0x42025000u)
#define MDF_S   reinterpret_cast<MDF_TypeDef *>(0x52025000u)

#else
#define MDF_NS  ((MDF_TypeDef *)0x42025000u)
#define MDF_S   ((MDF_TypeDef *)0x52025000u)
#endif

// GCR Configuration

#define MDF_GCR_ILVNB                   (0xFu<<4)
#define MDF_GCR_ILVNB_0                 (0x1u<<4)
#define MDF_GCR_TRGO                    (0x1u<<0)

#define MDF_GCR_ILVNB_B_0X0             (0x0u<<4)
#define MDF_GCR_ILVNB_B_0X1             (0x1u<<4)
#define MDF_GCR_ILVNB_B_0X2             (0x2u<<4)
#define MDF_GCR_ILVNB_B_0XF             (0xFu<<4)
#define MDF_GCR_TRGO_B_0X0              (0x0u<<0)
#define MDF_GCR_TRGO_B_0X1              (0x1u<<0)

// CKGCR Configuration

#define MDF_CKGCR_CKGACTIVE             (0x1u<<31)
#define MDF_CKGCR_PROCDIV               (0x7Fu<<24)
#define MDF_CKGCR_PROCDIV_0             (0x1u<<24)
#define MDF_CKGCR_CCKDIV                (0xFu<<16)
#define MDF_CKGCR_CCKDIV_0              (0x1u<<16)
#define MDF_CKGCR_TRGSRC                (0xFu<<12)
#define MDF_CKGCR_TRGSRC_0              (0x1u<<12)
#define MDF_CKGCR_TRGSENS               (0x1u<<8)
#define MDF_CKGCR_CCK1DIR               (0x1u<<6)
#define MDF_CKGCR_CCK0DIR               (0x1u<<5)
#define MDF_CKGCR_CKGMOD                (0x1u<<4)
#define MDF_CKGCR_CCK1EN                (0x1u<<2)
#define MDF_CKGCR_CCK0EN                (0x1u<<1)
#define MDF_CKGCR_CKGDEN                (0x1u<<0)

#define MDF_CKGCR_CKGACTIVE_B_0X0       (0x0u<<31)
#define MDF_CKGCR_CKGACTIVE_B_0X1       (0x1u<<31)
#define MDF_CKGCR_PROCDIV_B_0X0         (0x0u<<24)
#define MDF_CKGCR_PROCDIV_B_0X1         (0x1u<<24)
#define MDF_CKGCR_CCKDIV_B_0X0          (0x0u<<16)
#define MDF_CKGCR_CCKDIV_B_0X1          (0x1u<<16)
#define MDF_CKGCR_CCKDIV_B_0X2          (0x2u<<16)
#define MDF_CKGCR_CCKDIV_B_0XF          (0xFu<<16)
#define MDF_CKGCR_TRGSRC_B_0X2          (0x2u<<12)
#define MDF_CKGCR_TRGSRC_B_0X3          (0x3u<<12)
#define MDF_CKGCR_TRGSRC_B_0XF          (0xFu<<12)
#define MDF_CKGCR_TRGSENS_B_0X0         (0x0u<<8)
#define MDF_CKGCR_TRGSENS_B_0X1         (0x1u<<8)
#define MDF_CKGCR_CCK1DIR_B_0X0         (0x0u<<6)
#define MDF_CKGCR_CCK1DIR_B_0X1         (0x1u<<6)
#define MDF_CKGCR_CCK0DIR_B_0X0         (0x0u<<5)
#define MDF_CKGCR_CCK0DIR_B_0X1         (0x1u<<5)
#define MDF_CKGCR_CKGMOD_B_0X0          (0x0u<<4)
#define MDF_CKGCR_CKGMOD_B_0X1          (0x1u<<4)
#define MDF_CKGCR_CCK1EN_B_0X0          (0x0u<<2)
#define MDF_CKGCR_CCK1EN_B_0X1          (0x1u<<2)
#define MDF_CKGCR_CCK0EN_B_0X0          (0x0u<<1)
#define MDF_CKGCR_CCK0EN_B_0X1          (0x1u<<1)
#define MDF_CKGCR_CKGDEN_B_0X0          (0x0u<<0)
#define MDF_CKGCR_CKGDEN_B_0X1          (0x1u<<0)

// TRGISELR Configuration

