Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_TRGISELR_TRGI9SEL           (0x1u<<18)
#define MDF_TRGISELR_TRGI8SEL           (0x1u<<16)
#define MDF_TRGISELR_TRGI7SEL           (0x1u<<14)
#define MDF_TRGISELR_TRGI6SEL           (0x1u<<12)
#define MDF_TRGISELR_TRGI5SEL           (0x1u<<10)
#define MDF_TRGISELR_TRGI4SEL           (0x1u<<8)
#define MDF_TRGISELR_TRGI3SEL           (0x1u<<6)
#define MDF_TRGISELR_TRGI2SEL           (0x1u<<4)

#define MDF_TRGISELR_TRGI9SEL_B_0X0     (0x0u<<18)
#define MDF_TRGISELR_TRGI9SEL_B_0X1     (0x1u<<18)
#define MDF_TRGISELR_TRGI8SEL_B_0X0     (0x0u<<16)
#define MDF_TRGISELR_TRGI8SEL_B_0X1     (0x1u<<16)
#define MDF_TRGISELR_TRGI7SEL_B_0X0     (0x0u<<14)
#define MDF_TRGISELR_TRGI7SEL_B_0X1     (0x1u<<14)
#define MDF_TRGISELR_TRGI6SEL_B_0X0     (0x0u<<12)
#define MDF_TRGISELR_TRGI6SEL_B_0X1     (0x1u<<12)
#define MDF_TRGISELR_TRGI5SEL_B_0X0     (0x0u<<10)
#define MDF_TRGISELR_TRGI5SEL_B_0X1     (0x1u<<10)
#define MDF_TRGISELR_TRGI4SEL_B_0X0     (0x0u<<8)
#define MDF_TRGISELR_TRGI4SEL_B_0X1     (0x1u<<8)
#define MDF_TRGISELR_TRGI3SEL_B_0X0     (0x0u<<6)
#define MDF_TRGISELR_TRGI3SEL_B_0X1     (0x1u<<6)
#define MDF_TRGISELR_TRGI2SEL_B_0X0     (0x0u<<4)
#define MDF_TRGISELR_TRGI2SEL_B_0X1     (0x1u<<4)

// SITF0CR Configuration

#define MDF_SITF0CR_SITFACTIVE          (0x1u<<31)
#define MDF_SITF0CR_STH                 (0x1Fu<<8)
#define MDF_SITF0CR_STH_0               (0x1u<<8)
#define MDF_SITF0CR_SITFMOD             (0x3u<<4)
#define MDF_SITF0CR_SITFMOD_0           (0x1u<<4)
#define MDF_SITF0CR_SCKSRC              (0x3u<<1)
#define MDF_SITF0CR_SCKSRC_0            (0x1u<<1)
#define MDF_SITF0CR_SITFEN              (0x1u<<0)

#define MDF_SITF0CR_SITFACTIVE_B_0X0    (0x0u<<31)
#define MDF_SITF0CR_SITFACTIVE_B_0X1    (0x1u<<31)
#define MDF_SITF0CR_SITFMOD_B_0X0       (0x0u<<4)
#define MDF_SITF0CR_SITFMOD_B_0X1       (0x1u<<4)
#define MDF_SITF0CR_SITFMOD_B_0X2       (0x2u<<4)
#define MDF_SITF0CR_SITFMOD_B_0X3       (0x3u<<4)
#define MDF_SITF0CR_SCKSRC_B_0X0        (0x0u<<1)
#define MDF_SITF0CR_SCKSRC_B_0X1        (0x1u<<1)
#define MDF_SITF0CR_SITFEN_B_0X0        (0x0u<<0)
#define MDF_SITF0CR_SITFEN_B_0X1        (0x1u<<0)

// BSMX0CR Configuration

#define MDF_BSMX0CR_BSMXACTIVE          (0x1u<<31)
#define MDF_BSMX0CR_BSSEL               (0x1Fu<<0)
#define MDF_BSMX0CR_BSSEL_0             (0x1u<<0)

#define MDF_BSMX0CR_BSMXACTIVE_B_0X0    (0x0u<<31)
#define MDF_BSMX0CR_BSMXACTIVE_B_0X1    (0x1u<<31)
#define MDF_BSMX0CR_BSSEL_B_0X0         (0x0u<<0)
#define MDF_BSMX0CR_BSSEL_B_0X1         (0x1u<<0)
#define MDF_BSMX0CR_BSSEL_B_0X2         (0x2u<<0)
#define MDF_BSMX0CR_BSSEL_B_0X3         (0x3u<<0)
#define MDF_BSMX0CR_BSSEL_B_0X1E        (0x1Eu<<0)
#define MDF_BSMX0CR_BSSEL_B_0X1F        (0x1Fu<<0)

// DFLT0CR Configuration

#define MDF_DFLT0CR_DFLTACTIVE          (0x1u<<31)
#define MDF_DFLT0CR_DFLTRUN             (0x1u<<30)
#define MDF_DFLT0CR_NBDIS               (0xFFu<<20)
#define MDF_DFLT0CR_NBDIS_0             (0x1u<<20)
#define MDF_DFLT0CR_SNPSFMT             (0x1u<<16)
#define MDF_DFLT0CR_TRGSRC              (0xFu<<12)
#define MDF_DFLT0CR_TRGSRC_0            (0x1u<<12)
#define MDF_DFLT0CR_TRGSENS             (0x1u<<8)
#define MDF_DFLT0CR_ACQMOD              (0x7u<<4)
#define MDF_DFLT0CR_ACQMOD_0            (0x1u<<4)
#define MDF_DFLT0CR_FTH                 (0x1u<<2)
#define MDF_DFLT0CR_DMAEN               (0x1u<<1)
#define MDF_DFLT0CR_DFLTEN              (0x1u<<0)

#define MDF_DFLT0CR_DFLTACTIVE_B_0X0    (0x0u<<31)
#define MDF_DFLT0CR_DFLTACTIVE_B_0X1    (0x1u<<31)
#define MDF_DFLT0CR_DFLTRUN_B_0X0       (0x0u<<30)
#define MDF_DFLT0CR_DFLTRUN_B_0X1       (0x1u<<30)
#define MDF_DFLT0CR_NBDIS_B_0X0         (0x0u<<20)
#define MDF_DFLT0CR_NBDIS_B_0X1         (0x1u<<20)
#define MDF_DFLT0CR_SNPSFMT_B_0X0       (0x0u<<16)
#define MDF_DFLT0CR_SNPSFMT_B_0X1       (0x1u<<16)
#define MDF_DFLT0CR_TRGSRC_B_0X0        (0x0u<<12)
#define MDF_DFLT0CR_TRGSRC_B_0X1        (0x1u<<12)
#define MDF_DFLT0CR_TRGSRC_B_0X2        (0x2u<<12)
#define MDF_DFLT0CR_TRGSRC_B_0XF        (0xFu<<12)
#define MDF_DFLT0CR_TRGSENS_B_0X0       (0x0u<<8)
#define MDF_DFLT0CR_TRGSENS_B_0X1       (0x1u<<8)
#define MDF_DFLT0CR_ACQMOD_B_0X0        (0x0u<<4)
#define MDF_DFLT0CR_ACQMOD_B_0X1        (0x1u<<4)
#define MDF_DFLT0CR_ACQMOD_B_0X2        (0x2u<<4)
#define MDF_DFLT0CR_ACQMOD_B_0X3        (0x3u<<4)
#define MDF_DFLT0CR_ACQMOD_B_0X4        (0x4u<<4)
#define MDF_DFLT0CR_ACQMOD_B_0X5        (0x5u<<4)
#define MDF_DFLT0CR_FTH_B_0X0           (0x0u<<2)
#define MDF_DFLT0CR_FTH_B_0X1           (0x1u<<2)
#define MDF_DFLT0CR_DMAEN_B_0X0         (0x0u<<1)
#define MDF_DFLT0CR_DMAEN_B_0X1         (0x1u<<1)
#define MDF_DFLT0CR_DFLTEN_B_0X0        (0x0u<<0)
#define MDF_DFLT0CR_DFLTEN_B_0X1        (0x1u<<0)

// DFLT0CICR Configuration

#define MDF_DFLT0CICR_SCALE             (0x3Fu<<20)
#define MDF_DFLT0CICR_SCALE_0           (0x1u<<20)
#define MDF_DFLT0CICR_MCICD8            (0x1u<<16)
#define MDF_DFLT0CICR_MCICD             (0xFFu<<8)
#define MDF_DFLT0CICR_MCICD_0           (0x1u<<8)
#define MDF_DFLT0CICR_CICMOD            (0x7u<<4)
#define MDF_DFLT0CICR_CICMOD_0          (0x1u<<4)
#define MDF_DFLT0CICR_DATSRC            (0x3u<<0)
#define MDF_DFLT0CICR_DATSRC_0          (0x1u<<0)

#define MDF_DFLT0CICR_SCALE_B_0X0       (0x0u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X1       (0x1u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X2       (0x2u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X18      (0x18u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X20      (0x20u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X21      (0x21u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X22      (0x22u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X23      (0x23u<<20)
#define MDF_DFLT0CICR_SCALE_B_0X2E      (0x2Eu<<20)
#define MDF_DFLT0CICR_SCALE_B_0X2F      (0x2Fu<<20)
#define MDF_DFLT0CICR_MCICD8_B_0X0      (0x0u<<16)
#define MDF_DFLT0CICR_MCICD8_B_0X1      (0x1u<<16)
#define MDF_DFLT0CICR_MCICD_B_0X0       (0x0u<<8)
#define MDF_DFLT0CICR_MCICD_B_0X1       (0x1u<<8)
#define MDF_DFLT0CICR_CICMOD_B_0X0      (0x0u<<4)
#define MDF_DFLT0CICR_CICMOD_B_0X1      (0x1u<<4)
#define MDF_DFLT0CICR_CICMOD_B_0X2      (0x2u<<4)
#define MDF_DFLT0CICR_CICMOD_B_0X3      (0x3u<<4)
#define MDF_DFLT0CICR_CICMOD_B_0X4      (0x4u<<4)
#define MDF_DFLT0CICR_DATSRC_B_0X2      (0x2u<<0)
#define MDF_DFLT0CICR_DATSRC_B_0X3      (0x3u<<0)

// DFLT0RSFR Configuration

#define MDF_DFLT0RSFR_HPFC              (0x3u<<8)
#define MDF_DFLT0RSFR_HPFC_0            (0x1u<<8)
#define MDF_DFLT0RSFR_HPFBYP            (0x1u<<7)
#define MDF_DFLT0RSFR_RSFLTD            (0x1u<<4)
#define MDF_DFLT0RSFR_RSFLTBYP          (0x1u<<0)

#define MDF_DFLT0RSFR_HPFC_B_0X0        (0x0u<<8)
#define MDF_DFLT0RSFR_HPFC_B_0X1        (0x1u<<8)
#define MDF_DFLT0RSFR_HPFC_B_0X2        (0x2u<<8)
#define MDF_DFLT0RSFR_HPFC_B_0X3        (0x3u<<8)
#define MDF_DFLT0RSFR_HPFBYP_B_0X0      (0x0u<<7)
#define MDF_DFLT0RSFR_HPFBYP_B_0X1      (0x1u<<7)
#define MDF_DFLT0RSFR_RSFLTD_B_0X0      (0x0u<<4)
#define MDF_DFLT0RSFR_RSFLTD_B_0X1      (0x1u<<4)
#define MDF_DFLT0RSFR_RSFLTBYP_B_0X0    (0x0u<<0)
#define MDF_DFLT0RSFR_RSFLTBYP_B_0X1    (0x1u<<0)

// DFLT0INTR Configuration

#define MDF_DFLT0INTR_INTVAL            (0x7Fu<<4)
#define MDF_DFLT0INTR_INTVAL_0          (0x1u<<4)
#define MDF_DFLT0INTR_INTDIV            (0x3u<<0)
#define MDF_DFLT0INTR_INTDIV_0          (0x1u<<0)

#define MDF_DFLT0INTR_INTVAL_B_0X0      (0x0u<<4)
#define MDF_DFLT0INTR_INTVAL_B_0X1      (0x1u<<4)
#define MDF_DFLT0INTR_INTDIV_B_0X0      (0x0u<<0)
#define MDF_DFLT0INTR_INTDIV_B_0X1      (0x1u<<0)
#define MDF_DFLT0INTR_INTDIV_B_0X2      (0x2u<<0)
#define MDF_DFLT0INTR_INTDIV_B_0X3      (0x3u<<0)

// OLD0CR Configuration

#define MDF_OLD0CR_OLDACTIVE            (0x1u<<31)
#define MDF_OLD0CR_ACICD                (0x1Fu<<17)
#define MDF_OLD0CR_ACICD_0              (0x1u<<17)
#define MDF_OLD0CR_ACICN                (0x3u<<12)
#define MDF_OLD0CR_ACICN_0              (0x1u<<12)
#define MDF_OLD0CR_BKOLD                (0xFu<<4)
#define MDF_OLD0CR_BKOLD_0              (0x1u<<4)
#define MDF_OLD0CR_THINB                (0x1u<<1)
#define MDF_OLD0CR_OLDEN                (0x1u<<0)

