Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_OLD0CR_OLDACTIVE_B_0X0      (0x0u<<31)
#define MDF_OLD0CR_OLDACTIVE_B_0X1      (0x1u<<31)
#define MDF_OLD0CR_ACICD_B_0X0          (0x0u<<17)
#define MDF_OLD0CR_ACICD_B_0X1          (0x1u<<17)
#define MDF_OLD0CR_ACICN_B_0X0          (0x0u<<12)
#define MDF_OLD0CR_ACICN_B_0X1          (0x1u<<12)
#define MDF_OLD0CR_ACICN_B_0X2          (0x2u<<12)
#define MDF_OLD0CR_ACICN_B_0X3          (0x3u<<12)
#define MDF_OLD0CR_THINB_B_0X0          (0x0u<<1)
#define MDF_OLD0CR_THINB_B_0X1          (0x1u<<1)
#define MDF_OLD0CR_OLDEN_B_0X0          (0x0u<<0)
#define MDF_OLD0CR_OLDEN_B_0X1          (0x1u<<0)

// OLD0THLR Configuration

#define MDF_OLD0THLR_OLDTHL             (0x3FFFFFFu<<0)
#define MDF_OLD0THLR_OLDTHL_0           (0x1u<<0)

// OLD0THHR Configuration

#define MDF_OLD0THHR_OLDTHH             (0x3FFFFFFu<<0)
#define MDF_OLD0THHR_OLDTHH_0           (0x1u<<0)

// DLY0CR Configuration

#define MDF_DLY0CR_SKPBF                (0x1u<<31)
#define MDF_DLY0CR_SKPDLY               (0x7Fu<<0)
#define MDF_DLY0CR_SKPDLY_0             (0x1u<<0)

#define MDF_DLY0CR_SKPBF_B_0X0          (0x0u<<31)
#define MDF_DLY0CR_SKPBF_B_0X1          (0x1u<<31)
#define MDF_DLY0CR_SKPDLY_B_0X0         (0x0u<<0)
#define MDF_DLY0CR_SKPDLY_B_0X1         (0x1u<<0)

// SCD0CR Configuration

#define MDF_SCD0CR_SCDACTIVE            (0x1u<<31)
#define MDF_SCD0CR_SCDT                 (0xFFu<<12)
#define MDF_SCD0CR_SCDT_0               (0x1u<<12)
#define MDF_SCD0CR_BKSCD                (0xFu<<4)
#define MDF_SCD0CR_BKSCD_0              (0x1u<<4)
#define MDF_SCD0CR_SCDEN                (0x1u<<0)

#define MDF_SCD0CR_SCDACTIVE_B_0X0      (0x0u<<31)
#define MDF_SCD0CR_SCDACTIVE_B_0X1      (0x1u<<31)
#define MDF_SCD0CR_SCDT_B_0X0           (0x0u<<12)
#define MDF_SCD0CR_SCDT_B_0X1           (0x1u<<12)
#define MDF_SCD0CR_SCDEN_B_0X0          (0x0u<<0)
#define MDF_SCD0CR_SCDEN_B_0X1          (0x1u<<0)

// DFLT0IER Configuration

#define MDF_DFLT0IER_RFOVRIE            (0x1u<<11)
#define MDF_DFLT0IER_CKABIE             (0x1u<<10)
#define MDF_DFLT0IER_SATIE              (0x1u<<9)
#define MDF_DFLT0IER_SCDIE              (0x1u<<8)
#define MDF_DFLT0IER_SSOVRIE            (0x1u<<7)
#define MDF_DFLT0IER_OLDIE              (0x1u<<4)
#define MDF_DFLT0IER_SSDRIE             (0x1u<<2)
#define MDF_DFLT0IER_DOVRIE             (0x1u<<1)
#define MDF_DFLT0IER_FTHIE              (0x1u<<0)

#define MDF_DFLT0IER_RFOVRIE_B_0X0      (0x0u<<11)
#define MDF_DFLT0IER_RFOVRIE_B_0X1      (0x1u<<11)
#define MDF_DFLT0IER_CKABIE_B_0X0       (0x0u<<10)
#define MDF_DFLT0IER_CKABIE_B_0X1       (0x1u<<10)
#define MDF_DFLT0IER_SATIE_B_0X0        (0x0u<<9)
#define MDF_DFLT0IER_SATIE_B_0X1        (0x1u<<9)
#define MDF_DFLT0IER_SCDIE_B_0X0        (0x0u<<8)
#define MDF_DFLT0IER_SCDIE_B_0X1        (0x1u<<8)
#define MDF_DFLT0IER_SSOVRIE_B_0X0      (0x0u<<7)
#define MDF_DFLT0IER_SSOVRIE_B_0X1      (0x1u<<7)
#define MDF_DFLT0IER_OLDIE_B_0X0        (0x0u<<4)
#define MDF_DFLT0IER_OLDIE_B_0X1        (0x1u<<4)
#define MDF_DFLT0IER_SSDRIE_B_0X0       (0x0u<<2)
#define MDF_DFLT0IER_SSDRIE_B_0X1       (0x1u<<2)
#define MDF_DFLT0IER_DOVRIE_B_0X0       (0x0u<<1)
#define MDF_DFLT0IER_DOVRIE_B_0X1       (0x1u<<1)
#define MDF_DFLT0IER_FTHIE_B_0X0        (0x0u<<0)
#define MDF_DFLT0IER_FTHIE_B_0X1        (0x1u<<0)

// DFLT0ISR Configuration

#define MDF_DFLT0ISR_RFOVRF             (0x1u<<11)
#define MDF_DFLT0ISR_CKABF              (0x1u<<10)
#define MDF_DFLT0ISR_SATF               (0x1u<<9)
#define MDF_DFLT0ISR_SCDF               (0x1u<<8)
#define MDF_DFLT0ISR_SSOVRF             (0x1u<<7)
#define MDF_DFLT0ISR_THHF               (0x1u<<6)
#define MDF_DFLT0ISR_THLF               (0x1u<<5)
#define MDF_DFLT0ISR_OLDF               (0x1u<<4)
#define MDF_DFLT0ISR_RXNEF              (0x1u<<3)
#define MDF_DFLT0ISR_SSDRF              (0x1u<<2)
#define MDF_DFLT0ISR_DOVRF              (0x1u<<1)
#define MDF_DFLT0ISR_FTHF               (0x1u<<0)

#define MDF_DFLT0ISR_RFOVRF_B_0X0       (0x0u<<11)
#define MDF_DFLT0ISR_RFOVRF_B_0X1       (0x1u<<11)
#define MDF_DFLT0ISR_CKABF_B_0X0        (0x0u<<10)
#define MDF_DFLT0ISR_CKABF_B_0X1        (0x1u<<10)
#define MDF_DFLT0ISR_SATF_B_0X0         (0x0u<<9)
#define MDF_DFLT0ISR_SATF_B_0X1         (0x1u<<9)
#define MDF_DFLT0ISR_SCDF_B_0X0         (0x0u<<8)
#define MDF_DFLT0ISR_SCDF_B_0X1         (0x1u<<8)
#define MDF_DFLT0ISR_SSOVRF_B_0X0       (0x0u<<7)
#define MDF_DFLT0ISR_SSOVRF_B_0X1       (0x1u<<7)
#define MDF_DFLT0ISR_THHF_B_0X0         (0x0u<<6)
#define MDF_DFLT0ISR_THHF_B_0X1         (0x1u<<6)
#define MDF_DFLT0ISR_THLF_B_0X0         (0x0u<<5)
#define MDF_DFLT0ISR_THLF_B_0X1         (0x1u<<5)
#define MDF_DFLT0ISR_OLDF_B_0X0         (0x0u<<4)
#define MDF_DFLT0ISR_OLDF_B_0X1         (0x1u<<4)
#define MDF_DFLT0ISR_RXNEF_B_0X0        (0x0u<<3)
#define MDF_DFLT0ISR_RXNEF_B_0X1        (0x1u<<3)
#define MDF_DFLT0ISR_SSDRF_B_0X0        (0x0u<<2)
#define MDF_DFLT0ISR_SSDRF_B_0X1        (0x1u<<2)
#define MDF_DFLT0ISR_DOVRF_B_0X0        (0x0u<<1)
#define MDF_DFLT0ISR_DOVRF_B_0X1        (0x1u<<1)
#define MDF_DFLT0ISR_FTHF_B_0X0         (0x0u<<0)
#define MDF_DFLT0ISR_FTHF_B_0X1         (0x1u<<0)

// OEC0CR Configuration

#define MDF_OEC0CR_OFFSET               (0x3FFFFFFu<<0)
#define MDF_OEC0CR_OFFSET_0             (0x1u<<0)

// SNPS0DR Configuration

#define MDF_SNPS0DR_SDR                 (0xFFFFu<<16)
#define MDF_SNPS0DR_SDR_0               (0x1u<<16)
#define MDF_SNPS0DR_EXTSDR              (0x7Fu<<9)
#define MDF_SNPS0DR_EXTSDR_0            (0x1u<<9)
#define MDF_SNPS0DR_MCICDC              (0x1FFu<<0)
#define MDF_SNPS0DR_MCICDC_0            (0x1u<<0)

// DFLT0DR Configuration

#define MDF_DFLT0DR_DR                  (0xFFFFFFu<<8)
#define MDF_DFLT0DR_DR_0                (0x1u<<8)

// SITF1CR Configuration

#define MDF_SITF1CR_SITFACTIVE          (0x1u<<31)
#define MDF_SITF1CR_STH                 (0x1Fu<<8)
#define MDF_SITF1CR_STH_0               (0x1u<<8)
#define MDF_SITF1CR_SITFMOD             (0x3u<<4)
#define MDF_SITF1CR_SITFMOD_0           (0x1u<<4)
#define MDF_SITF1CR_SCKSRC              (0x3u<<1)
#define MDF_SITF1CR_SCKSRC_0            (0x1u<<1)
#define MDF_SITF1CR_SITFEN              (0x1u<<0)

#define MDF_SITF1CR_SITFACTIVE_B_0X0    (0x0u<<31)
#define MDF_SITF1CR_SITFACTIVE_B_0X1    (0x1u<<31)
#define MDF_SITF1CR_SITFMOD_B_0X0       (0x0u<<4)
#define MDF_SITF1CR_SITFMOD_B_0X1       (0x1u<<4)
#define MDF_SITF1CR_SITFMOD_B_0X2       (0x2u<<4)
#define MDF_SITF1CR_SITFMOD_B_0X3       (0x3u<<4)
#define MDF_SITF1CR_SCKSRC_B_0X0        (0x0u<<1)
#define MDF_SITF1CR_SCKSRC_B_0X1        (0x1u<<1)
#define MDF_SITF1CR_SITFEN_B_0X0        (0x0u<<0)
#define MDF_SITF1CR_SITFEN_B_0X1        (0x1u<<0)

// BSMX1CR Configuration

