Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_BSMX1CR_BSMXACTIVE          (0x1u<<31)
#define MDF_BSMX1CR_BSSEL               (0x1Fu<<0)
#define MDF_BSMX1CR_BSSEL_0             (0x1u<<0)

#define MDF_BSMX1CR_BSMXACTIVE_B_0X0    (0x0u<<31)
#define MDF_BSMX1CR_BSMXACTIVE_B_0X1    (0x1u<<31)
#define MDF_BSMX1CR_BSSEL_B_0X0         (0x0u<<0)
#define MDF_BSMX1CR_BSSEL_B_0X1         (0x1u<<0)
#define MDF_BSMX1CR_BSSEL_B_0X2         (0x2u<<0)
#define MDF_BSMX1CR_BSSEL_B_0X3         (0x3u<<0)
#define MDF_BSMX1CR_BSSEL_B_0X1E        (0x1Eu<<0)
#define MDF_BSMX1CR_BSSEL_B_0X1F        (0x1Fu<<0)

// DFLT1CR Configuration

#define MDF_DFLT1CR_DFLTACTIVE          (0x1u<<31)
#define MDF_DFLT1CR_DFLTRUN             (0x1u<<30)
#define MDF_DFLT1CR_NBDIS               (0xFFu<<20)
#define MDF_DFLT1CR_NBDIS_0             (0x1u<<20)
#define MDF_DFLT1CR_SNPSFMT             (0x1u<<16)
#define MDF_DFLT1CR_TRGSRC              (0xFu<<12)
#define MDF_DFLT1CR_TRGSRC_0            (0x1u<<12)
#define MDF_DFLT1CR_TRGSENS             (0x1u<<8)
#define MDF_DFLT1CR_ACQMOD              (0x7u<<4)
#define MDF_DFLT1CR_ACQMOD_0            (0x1u<<4)
#define MDF_DFLT1CR_FTH                 (0x1u<<2)
#define MDF_DFLT1CR_DMAEN               (0x1u<<1)
#define MDF_DFLT1CR_DFLTEN              (0x1u<<0)

#define MDF_DFLT1CR_DFLTACTIVE_B_0X0    (0x0u<<31)
#define MDF_DFLT1CR_DFLTACTIVE_B_0X1    (0x1u<<31)
#define MDF_DFLT1CR_DFLTRUN_B_0X0       (0x0u<<30)
#define MDF_DFLT1CR_DFLTRUN_B_0X1       (0x1u<<30)
#define MDF_DFLT1CR_NBDIS_B_0X0         (0x0u<<20)
#define MDF_DFLT1CR_NBDIS_B_0X1         (0x1u<<20)
#define MDF_DFLT1CR_SNPSFMT_B_0X0       (0x0u<<16)
#define MDF_DFLT1CR_SNPSFMT_B_0X1       (0x1u<<16)
#define MDF_DFLT1CR_TRGSRC_B_0X0        (0x0u<<12)
#define MDF_DFLT1CR_TRGSRC_B_0X1        (0x1u<<12)
#define MDF_DFLT1CR_TRGSRC_B_0X2        (0x2u<<12)
#define MDF_DFLT1CR_TRGSRC_B_0XF        (0xFu<<12)
#define MDF_DFLT1CR_TRGSENS_B_0X0       (0x0u<<8)
#define MDF_DFLT1CR_TRGSENS_B_0X1       (0x1u<<8)
#define MDF_DFLT1CR_ACQMOD_B_0X0        (0x0u<<4)
#define MDF_DFLT1CR_ACQMOD_B_0X1        (0x1u<<4)
#define MDF_DFLT1CR_ACQMOD_B_0X2        (0x2u<<4)
#define MDF_DFLT1CR_ACQMOD_B_0X3        (0x3u<<4)
#define MDF_DFLT1CR_ACQMOD_B_0X4        (0x4u<<4)
#define MDF_DFLT1CR_ACQMOD_B_0X5        (0x5u<<4)
#define MDF_DFLT1CR_FTH_B_0X0           (0x0u<<2)
#define MDF_DFLT1CR_FTH_B_0X1           (0x1u<<2)
#define MDF_DFLT1CR_DMAEN_B_0X0         (0x0u<<1)
#define MDF_DFLT1CR_DMAEN_B_0X1         (0x1u<<1)
#define MDF_DFLT1CR_DFLTEN_B_0X0        (0x0u<<0)
#define MDF_DFLT1CR_DFLTEN_B_0X1        (0x1u<<0)

// DFLT1CICR Configuration

#define MDF_DFLT1CICR_SCALE             (0x3Fu<<20)
#define MDF_DFLT1CICR_SCALE_0           (0x1u<<20)
#define MDF_DFLT1CICR_MCICD8            (0x1u<<16)
#define MDF_DFLT1CICR_MCICD             (0xFFu<<8)
#define MDF_DFLT1CICR_MCICD_0           (0x1u<<8)
#define MDF_DFLT1CICR_CICMOD            (0x7u<<4)
#define MDF_DFLT1CICR_CICMOD_0          (0x1u<<4)
#define MDF_DFLT1CICR_DATSRC            (0x3u<<0)
#define MDF_DFLT1CICR_DATSRC_0          (0x1u<<0)

#define MDF_DFLT1CICR_SCALE_B_0X0       (0x0u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X1       (0x1u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X2       (0x2u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X18      (0x18u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X20      (0x20u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X21      (0x21u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X22      (0x22u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X23      (0x23u<<20)
#define MDF_DFLT1CICR_SCALE_B_0X2E      (0x2Eu<<20)
#define MDF_DFLT1CICR_SCALE_B_0X2F      (0x2Fu<<20)
#define MDF_DFLT1CICR_MCICD8_B_0X0      (0x0u<<16)
#define MDF_DFLT1CICR_MCICD8_B_0X1      (0x1u<<16)
#define MDF_DFLT1CICR_MCICD_B_0X0       (0x0u<<8)
#define MDF_DFLT1CICR_MCICD_B_0X1       (0x1u<<8)
#define MDF_DFLT1CICR_CICMOD_B_0X0      (0x0u<<4)
#define MDF_DFLT1CICR_CICMOD_B_0X1      (0x1u<<4)
#define MDF_DFLT1CICR_CICMOD_B_0X2      (0x2u<<4)
#define MDF_DFLT1CICR_CICMOD_B_0X3      (0x3u<<4)
#define MDF_DFLT1CICR_CICMOD_B_0X4      (0x4u<<4)
#define MDF_DFLT1CICR_DATSRC_B_0X2      (0x2u<<0)
#define MDF_DFLT1CICR_DATSRC_B_0X3      (0x3u<<0)

// DFLT1RSFR Configuration

#define MDF_DFLT1RSFR_HPFC              (0x3u<<8)
#define MDF_DFLT1RSFR_HPFC_0            (0x1u<<8)
#define MDF_DFLT1RSFR_HPFBYP            (0x1u<<7)
#define MDF_DFLT1RSFR_RSFLTD            (0x1u<<4)
#define MDF_DFLT1RSFR_RSFLTBYP          (0x1u<<0)

#define MDF_DFLT1RSFR_HPFC_B_0X0        (0x0u<<8)
#define MDF_DFLT1RSFR_HPFC_B_0X1        (0x1u<<8)
#define MDF_DFLT1RSFR_HPFC_B_0X2        (0x2u<<8)
#define MDF_DFLT1RSFR_HPFC_B_0X3        (0x3u<<8)
#define MDF_DFLT1RSFR_HPFBYP_B_0X0      (0x0u<<7)
#define MDF_DFLT1RSFR_HPFBYP_B_0X1      (0x1u<<7)
#define MDF_DFLT1RSFR_RSFLTD_B_0X0      (0x0u<<4)
#define MDF_DFLT1RSFR_RSFLTD_B_0X1      (0x1u<<4)
#define MDF_DFLT1RSFR_RSFLTBYP_B_0X0    (0x0u<<0)
#define MDF_DFLT1RSFR_RSFLTBYP_B_0X1    (0x1u<<0)

// DFLT1INTR Configuration

#define MDF_DFLT1INTR_INTVAL            (0x7Fu<<4)
#define MDF_DFLT1INTR_INTVAL_0          (0x1u<<4)
#define MDF_DFLT1INTR_INTDIV            (0x3u<<0)
#define MDF_DFLT1INTR_INTDIV_0          (0x1u<<0)

#define MDF_DFLT1INTR_INTVAL_B_0X0      (0x0u<<4)
#define MDF_DFLT1INTR_INTVAL_B_0X1      (0x1u<<4)
#define MDF_DFLT1INTR_INTDIV_B_0X0      (0x0u<<0)
#define MDF_DFLT1INTR_INTDIV_B_0X1      (0x1u<<0)
#define MDF_DFLT1INTR_INTDIV_B_0X2      (0x2u<<0)
#define MDF_DFLT1INTR_INTDIV_B_0X3      (0x3u<<0)

// OLD1CR Configuration

#define MDF_OLD1CR_OLDACTIVE            (0x1u<<31)
#define MDF_OLD1CR_ACICD                (0x1Fu<<17)
#define MDF_OLD1CR_ACICD_0              (0x1u<<17)
#define MDF_OLD1CR_ACICN                (0x3u<<12)
#define MDF_OLD1CR_ACICN_0              (0x1u<<12)
#define MDF_OLD1CR_BKOLD                (0xFu<<4)
#define MDF_OLD1CR_BKOLD_0              (0x1u<<4)
#define MDF_OLD1CR_THINB                (0x1u<<1)
#define MDF_OLD1CR_OLDEN                (0x1u<<0)

#define MDF_OLD1CR_OLDACTIVE_B_0X0      (0x0u<<31)
#define MDF_OLD1CR_OLDACTIVE_B_0X1      (0x1u<<31)
#define MDF_OLD1CR_ACICD_B_0X0          (0x0u<<17)
#define MDF_OLD1CR_ACICD_B_0X1          (0x1u<<17)
#define MDF_OLD1CR_ACICN_B_0X0          (0x0u<<12)
#define MDF_OLD1CR_ACICN_B_0X1          (0x1u<<12)
#define MDF_OLD1CR_ACICN_B_0X2          (0x2u<<12)
#define MDF_OLD1CR_ACICN_B_0X3          (0x3u<<12)
#define MDF_OLD1CR_THINB_B_0X0          (0x0u<<1)
#define MDF_OLD1CR_THINB_B_0X1          (0x1u<<1)
#define MDF_OLD1CR_OLDEN_B_0X0          (0x0u<<0)
#define MDF_OLD1CR_OLDEN_B_0X1          (0x1u<<0)

