Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
// OLD1THLR Configuration

#define MDF_OLD1THLR_OLDTHL             (0x3FFFFFFu<<0)
#define MDF_OLD1THLR_OLDTHL_0           (0x1u<<0)

// OLD1THHR Configuration

#define MDF_OLD1THHR_OLDTHH             (0x3FFFFFFu<<0)
#define MDF_OLD1THHR_OLDTHH_0           (0x1u<<0)

// DLY1CR Configuration

#define MDF_DLY1CR_SKPBF                (0x1u<<31)
#define MDF_DLY1CR_SKPDLY               (0x7Fu<<0)
#define MDF_DLY1CR_SKPDLY_0             (0x1u<<0)

#define MDF_DLY1CR_SKPBF_B_0X0          (0x0u<<31)
#define MDF_DLY1CR_SKPBF_B_0X1          (0x1u<<31)
#define MDF_DLY1CR_SKPDLY_B_0X0         (0x0u<<0)
#define MDF_DLY1CR_SKPDLY_B_0X1         (0x1u<<0)

// SCD1CR Configuration

#define MDF_SCD1CR_SCDACTIVE            (0x1u<<31)
#define MDF_SCD1CR_SCDT                 (0xFFu<<12)
#define MDF_SCD1CR_SCDT_0               (0x1u<<12)
#define MDF_SCD1CR_BKSCD                (0xFu<<4)
#define MDF_SCD1CR_BKSCD_0              (0x1u<<4)
#define MDF_SCD1CR_SCDEN                (0x1u<<0)

#define MDF_SCD1CR_SCDACTIVE_B_0X0      (0x0u<<31)
#define MDF_SCD1CR_SCDACTIVE_B_0X1      (0x1u<<31)
#define MDF_SCD1CR_SCDT_B_0X0           (0x0u<<12)
#define MDF_SCD1CR_SCDT_B_0X1           (0x1u<<12)
#define MDF_SCD1CR_SCDEN_B_0X0          (0x0u<<0)
#define MDF_SCD1CR_SCDEN_B_0X1          (0x1u<<0)

// DFLT1IER Configuration

#define MDF_DFLT1IER_RFOVRIE            (0x1u<<11)
#define MDF_DFLT1IER_CKABIE             (0x1u<<10)
#define MDF_DFLT1IER_SATIE              (0x1u<<9)
#define MDF_DFLT1IER_SCDIE              (0x1u<<8)
#define MDF_DFLT1IER_SSOVRIE            (0x1u<<7)
#define MDF_DFLT1IER_OLDIE              (0x1u<<4)
#define MDF_DFLT1IER_SSDRIE             (0x1u<<2)
#define MDF_DFLT1IER_DOVRIE             (0x1u<<1)
#define MDF_DFLT1IER_FTHIE              (0x1u<<0)

#define MDF_DFLT1IER_RFOVRIE_B_0X0      (0x0u<<11)
#define MDF_DFLT1IER_RFOVRIE_B_0X1      (0x1u<<11)
#define MDF_DFLT1IER_CKABIE_B_0X0       (0x0u<<10)
#define MDF_DFLT1IER_CKABIE_B_0X1       (0x1u<<10)
#define MDF_DFLT1IER_SATIE_B_0X0        (0x0u<<9)
#define MDF_DFLT1IER_SATIE_B_0X1        (0x1u<<9)
#define MDF_DFLT1IER_SCDIE_B_0X0        (0x0u<<8)
#define MDF_DFLT1IER_SCDIE_B_0X1        (0x1u<<8)
#define MDF_DFLT1IER_SSOVRIE_B_0X0      (0x0u<<7)
#define MDF_DFLT1IER_SSOVRIE_B_0X1      (0x1u<<7)
#define MDF_DFLT1IER_OLDIE_B_0X0        (0x0u<<4)
#define MDF_DFLT1IER_OLDIE_B_0X1        (0x1u<<4)
#define MDF_DFLT1IER_SSDRIE_B_0X0       (0x0u<<2)
#define MDF_DFLT1IER_SSDRIE_B_0X1       (0x1u<<2)
#define MDF_DFLT1IER_DOVRIE_B_0X0       (0x0u<<1)
#define MDF_DFLT1IER_DOVRIE_B_0X1       (0x1u<<1)
#define MDF_DFLT1IER_FTHIE_B_0X0        (0x0u<<0)
#define MDF_DFLT1IER_FTHIE_B_0X1        (0x1u<<0)

// DFLT1ISR Configuration

#define MDF_DFLT1ISR_RFOVRF             (0x1u<<11)
#define MDF_DFLT1ISR_CKABF              (0x1u<<10)
#define MDF_DFLT1ISR_SATF               (0x1u<<9)
#define MDF_DFLT1ISR_SCDF               (0x1u<<8)
#define MDF_DFLT1ISR_SSOVRF             (0x1u<<7)
#define MDF_DFLT1ISR_THHF               (0x1u<<6)
#define MDF_DFLT1ISR_THLF               (0x1u<<5)
#define MDF_DFLT1ISR_OLDF               (0x1u<<4)
#define MDF_DFLT1ISR_RXNEF              (0x1u<<3)
#define MDF_DFLT1ISR_SSDRF              (0x1u<<2)
#define MDF_DFLT1ISR_DOVRF              (0x1u<<1)
#define MDF_DFLT1ISR_FTHF               (0x1u<<0)

#define MDF_DFLT1ISR_RFOVRF_B_0X0       (0x0u<<11)
#define MDF_DFLT1ISR_RFOVRF_B_0X1       (0x1u<<11)
#define MDF_DFLT1ISR_CKABF_B_0X0        (0x0u<<10)
#define MDF_DFLT1ISR_CKABF_B_0X1        (0x1u<<10)
#define MDF_DFLT1ISR_SATF_B_0X0         (0x0u<<9)
#define MDF_DFLT1ISR_SATF_B_0X1         (0x1u<<9)
#define MDF_DFLT1ISR_SCDF_B_0X0         (0x0u<<8)
#define MDF_DFLT1ISR_SCDF_B_0X1         (0x1u<<8)
#define MDF_DFLT1ISR_SSOVRF_B_0X0       (0x0u<<7)
#define MDF_DFLT1ISR_SSOVRF_B_0X1       (0x1u<<7)
#define MDF_DFLT1ISR_THHF_B_0X0         (0x0u<<6)
#define MDF_DFLT1ISR_THHF_B_0X1         (0x1u<<6)
#define MDF_DFLT1ISR_THLF_B_0X0         (0x0u<<5)
#define MDF_DFLT1ISR_THLF_B_0X1         (0x1u<<5)
#define MDF_DFLT1ISR_OLDF_B_0X0         (0x0u<<4)
#define MDF_DFLT1ISR_OLDF_B_0X1         (0x1u<<4)
#define MDF_DFLT1ISR_RXNEF_B_0X0        (0x0u<<3)
#define MDF_DFLT1ISR_RXNEF_B_0X1        (0x1u<<3)
#define MDF_DFLT1ISR_SSDRF_B_0X0        (0x0u<<2)
#define MDF_DFLT1ISR_SSDRF_B_0X1        (0x1u<<2)
#define MDF_DFLT1ISR_DOVRF_B_0X0        (0x0u<<1)
#define MDF_DFLT1ISR_DOVRF_B_0X1        (0x1u<<1)
#define MDF_DFLT1ISR_FTHF_B_0X0         (0x0u<<0)
#define MDF_DFLT1ISR_FTHF_B_0X1         (0x1u<<0)

// OEC1CR Configuration

#define MDF_OEC1CR_OFFSET               (0x3FFFFFFu<<0)
#define MDF_OEC1CR_OFFSET_0             (0x1u<<0)

// SNPS1DR Configuration

#define MDF_SNPS1DR_SDR                 (0xFFFFu<<16)
#define MDF_SNPS1DR_SDR_0               (0x1u<<16)
#define MDF_SNPS1DR_EXTSDR              (0x7Fu<<9)
#define MDF_SNPS1DR_EXTSDR_0            (0x1u<<9)
#define MDF_SNPS1DR_MCICDC              (0x1FFu<<0)
#define MDF_SNPS1DR_MCICDC_0            (0x1u<<0)

// DFLT1DR Configuration

#define MDF_DFLT1DR_DR                  (0xFFFFFFu<<8)
#define MDF_DFLT1DR_DR_0                (0x1u<<8)

// SITF2CR Configuration

#define MDF_SITF2CR_SITFACTIVE          (0x1u<<31)
#define MDF_SITF2CR_STH                 (0x1Fu<<8)
#define MDF_SITF2CR_STH_0               (0x1u<<8)
#define MDF_SITF2CR_SITFMOD             (0x3u<<4)
#define MDF_SITF2CR_SITFMOD_0           (0x1u<<4)
#define MDF_SITF2CR_SCKSRC              (0x3u<<1)
#define MDF_SITF2CR_SCKSRC_0            (0x1u<<1)
#define MDF_SITF2CR_SITFEN              (0x1u<<0)

#define MDF_SITF2CR_SITFACTIVE_B_0X0    (0x0u<<31)
#define MDF_SITF2CR_SITFACTIVE_B_0X1    (0x1u<<31)
#define MDF_SITF2CR_SITFMOD_B_0X0       (0x0u<<4)
#define MDF_SITF2CR_SITFMOD_B_0X1       (0x1u<<4)
#define MDF_SITF2CR_SITFMOD_B_0X2       (0x2u<<4)
#define MDF_SITF2CR_SITFMOD_B_0X3       (0x3u<<4)
#define MDF_SITF2CR_SCKSRC_B_0X0        (0x0u<<1)
#define MDF_SITF2CR_SCKSRC_B_0X1        (0x1u<<1)
#define MDF_SITF2CR_SITFEN_B_0X0        (0x0u<<0)
#define MDF_SITF2CR_SITFEN_B_0X1        (0x1u<<0)

// BSMX2CR Configuration

#define MDF_BSMX2CR_BSMXACTIVE          (0x1u<<31)
#define MDF_BSMX2CR_BSSEL               (0x1Fu<<0)
#define MDF_BSMX2CR_BSSEL_0             (0x1u<<0)

#define MDF_BSMX2CR_BSMXACTIVE_B_0X0    (0x0u<<31)
#define MDF_BSMX2CR_BSMXACTIVE_B_0X1    (0x1u<<31)
#define MDF_BSMX2CR_BSSEL_B_0X0         (0x0u<<0)
#define MDF_BSMX2CR_BSSEL_B_0X1         (0x1u<<0)
#define MDF_BSMX2CR_BSSEL_B_0X2         (0x2u<<0)
#define MDF_BSMX2CR_BSSEL_B_0X3         (0x3u<<0)
#define MDF_BSMX2CR_BSSEL_B_0X1E        (0x1Eu<<0)
#define MDF_BSMX2CR_BSSEL_B_0X1F        (0x1Fu<<0)

// DFLT2CR Configuration

#define MDF_DFLT2CR_DFLTACTIVE          (0x1u<<31)
#define MDF_DFLT2CR_DFLTRUN             (0x1u<<30)
#define MDF_DFLT2CR_NBDIS               (0xFFu<<20)
#define MDF_DFLT2CR_NBDIS_0             (0x1u<<20)
#define MDF_DFLT2CR_SNPSFMT             (0x1u<<16)
#define MDF_DFLT2CR_TRGSRC              (0xFu<<12)
#define MDF_DFLT2CR_TRGSRC_0            (0x1u<<12)
#define MDF_DFLT2CR_TRGSENS             (0x1u<<8)
#define MDF_DFLT2CR_ACQMOD              (0x7u<<4)
#define MDF_DFLT2CR_ACQMOD_0            (0x1u<<4)
#define MDF_DFLT2CR_FTH                 (0x1u<<2)
#define MDF_DFLT2CR_DMAEN               (0x1u<<1)
#define MDF_DFLT2CR_DFLTEN              (0x1u<<0)

#define MDF_DFLT2CR_DFLTACTIVE_B_0X0    (0x0u<<31)
#define MDF_DFLT2CR_DFLTACTIVE_B_0X1    (0x1u<<31)
#define MDF_DFLT2CR_DFLTRUN_B_0X0       (0x0u<<30)
#define MDF_DFLT2CR_DFLTRUN_B_0X1       (0x1u<<30)
#define MDF_DFLT2CR_NBDIS_B_0X0         (0x0u<<20)
#define MDF_DFLT2CR_NBDIS_B_0X1         (0x1u<<20)
#define MDF_DFLT2CR_SNPSFMT_B_0X0       (0x0u<<16)
#define MDF_DFLT2CR_SNPSFMT_B_0X1       (0x1u<<16)
#define MDF_DFLT2CR_TRGSRC_B_0X0        (0x0u<<12)
#define MDF_DFLT2CR_TRGSRC_B_0X1        (0x1u<<12)
#define MDF_DFLT2CR_TRGSRC_B_0X2        (0x2u<<12)
#define MDF_DFLT2CR_TRGSRC_B_0XF        (0xFu<<12)
#define MDF_DFLT2CR_TRGSENS_B_0X0       (0x0u<<8)
#define MDF_DFLT2CR_TRGSENS_B_0X1       (0x1u<<8)
#define MDF_DFLT2CR_ACQMOD_B_0X0        (0x0u<<4)
#define MDF_DFLT2CR_ACQMOD_B_0X1        (0x1u<<4)
#define MDF_DFLT2CR_ACQMOD_B_0X2        (0x2u<<4)
#define MDF_DFLT2CR_ACQMOD_B_0X3        (0x3u<<4)
#define MDF_DFLT2CR_ACQMOD_B_0X4        (0x4u<<4)
#define MDF_DFLT2CR_ACQMOD_B_0X5        (0x5u<<4)
#define MDF_DFLT2CR_FTH_B_0X0           (0x0u<<2)
#define MDF_DFLT2CR_FTH_B_0X1           (0x1u<<2)
#define MDF_DFLT2CR_DMAEN_B_0X0         (0x0u<<1)
#define MDF_DFLT2CR_DMAEN_B_0X1         (0x1u<<1)
#define MDF_DFLT2CR_DFLTEN_B_0X0        (0x0u<<0)
#define MDF_DFLT2CR_DFLTEN_B_0X1        (0x1u<<0)

// DFLT2CICR Configuration

