Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_DFLT2CICR_SCALE             (0x3Fu<<20)
#define MDF_DFLT2CICR_SCALE_0           (0x1u<<20)
#define MDF_DFLT2CICR_MCICD8            (0x1u<<16)
#define MDF_DFLT2CICR_MCICD             (0xFFu<<8)
#define MDF_DFLT2CICR_MCICD_0           (0x1u<<8)
#define MDF_DFLT2CICR_CICMOD            (0x7u<<4)
#define MDF_DFLT2CICR_CICMOD_0          (0x1u<<4)
#define MDF_DFLT2CICR_DATSRC            (0x3u<<0)
#define MDF_DFLT2CICR_DATSRC_0          (0x1u<<0)

#define MDF_DFLT2CICR_SCALE_B_0X0       (0x0u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X1       (0x1u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X2       (0x2u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X18      (0x18u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X20      (0x20u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X21      (0x21u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X22      (0x22u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X23      (0x23u<<20)
#define MDF_DFLT2CICR_SCALE_B_0X2E      (0x2Eu<<20)
#define MDF_DFLT2CICR_SCALE_B_0X2F      (0x2Fu<<20)
#define MDF_DFLT2CICR_MCICD8_B_0X0      (0x0u<<16)
#define MDF_DFLT2CICR_MCICD8_B_0X1      (0x1u<<16)
#define MDF_DFLT2CICR_MCICD_B_0X0       (0x0u<<8)
#define MDF_DFLT2CICR_MCICD_B_0X1       (0x1u<<8)
#define MDF_DFLT2CICR_CICMOD_B_0X0      (0x0u<<4)
#define MDF_DFLT2CICR_CICMOD_B_0X1      (0x1u<<4)
#define MDF_DFLT2CICR_CICMOD_B_0X2      (0x2u<<4)
#define MDF_DFLT2CICR_CICMOD_B_0X3      (0x3u<<4)
#define MDF_DFLT2CICR_CICMOD_B_0X4      (0x4u<<4)
#define MDF_DFLT2CICR_DATSRC_B_0X2      (0x2u<<0)
#define MDF_DFLT2CICR_DATSRC_B_0X3      (0x3u<<0)

// DFLT2RSFR Configuration

#define MDF_DFLT2RSFR_HPFC              (0x3u<<8)
#define MDF_DFLT2RSFR_HPFC_0            (0x1u<<8)
#define MDF_DFLT2RSFR_HPFBYP            (0x1u<<7)
#define MDF_DFLT2RSFR_RSFLTD            (0x1u<<4)
#define MDF_DFLT2RSFR_RSFLTBYP          (0x1u<<0)

#define MDF_DFLT2RSFR_HPFC_B_0X0        (0x0u<<8)
#define MDF_DFLT2RSFR_HPFC_B_0X1        (0x1u<<8)
#define MDF_DFLT2RSFR_HPFC_B_0X2        (0x2u<<8)
#define MDF_DFLT2RSFR_HPFC_B_0X3        (0x3u<<8)
#define MDF_DFLT2RSFR_HPFBYP_B_0X0      (0x0u<<7)
#define MDF_DFLT2RSFR_HPFBYP_B_0X1      (0x1u<<7)
#define MDF_DFLT2RSFR_RSFLTD_B_0X0      (0x0u<<4)
#define MDF_DFLT2RSFR_RSFLTD_B_0X1      (0x1u<<4)
#define MDF_DFLT2RSFR_RSFLTBYP_B_0X0    (0x0u<<0)
#define MDF_DFLT2RSFR_RSFLTBYP_B_0X1    (0x1u<<0)

// DFLT2INTR Configuration

#define MDF_DFLT2INTR_INTVAL            (0x7Fu<<4)
#define MDF_DFLT2INTR_INTVAL_0          (0x1u<<4)
#define MDF_DFLT2INTR_INTDIV            (0x3u<<0)
#define MDF_DFLT2INTR_INTDIV_0          (0x1u<<0)

#define MDF_DFLT2INTR_INTVAL_B_0X0      (0x0u<<4)
#define MDF_DFLT2INTR_INTVAL_B_0X1      (0x1u<<4)
#define MDF_DFLT2INTR_INTDIV_B_0X0      (0x0u<<0)
#define MDF_DFLT2INTR_INTDIV_B_0X1      (0x1u<<0)
#define MDF_DFLT2INTR_INTDIV_B_0X2      (0x2u<<0)
#define MDF_DFLT2INTR_INTDIV_B_0X3      (0x3u<<0)

// OLD2CR Configuration

#define MDF_OLD2CR_OLDACTIVE            (0x1u<<31)
#define MDF_OLD2CR_ACICD                (0x1Fu<<17)
#define MDF_OLD2CR_ACICD_0              (0x1u<<17)
#define MDF_OLD2CR_ACICN                (0x3u<<12)
#define MDF_OLD2CR_ACICN_0              (0x1u<<12)
#define MDF_OLD2CR_BKOLD                (0xFu<<4)
#define MDF_OLD2CR_BKOLD_0              (0x1u<<4)
#define MDF_OLD2CR_THINB                (0x1u<<1)
#define MDF_OLD2CR_OLDEN                (0x1u<<0)

#define MDF_OLD2CR_OLDACTIVE_B_0X0      (0x0u<<31)
#define MDF_OLD2CR_OLDACTIVE_B_0X1      (0x1u<<31)
#define MDF_OLD2CR_ACICD_B_0X0          (0x0u<<17)
#define MDF_OLD2CR_ACICD_B_0X1          (0x1u<<17)
#define MDF_OLD2CR_ACICN_B_0X0          (0x0u<<12)
#define MDF_OLD2CR_ACICN_B_0X1          (0x1u<<12)
#define MDF_OLD2CR_ACICN_B_0X2          (0x2u<<12)
#define MDF_OLD2CR_ACICN_B_0X3          (0x3u<<12)
#define MDF_OLD2CR_THINB_B_0X0          (0x0u<<1)
#define MDF_OLD2CR_THINB_B_0X1          (0x1u<<1)
#define MDF_OLD2CR_OLDEN_B_0X0          (0x0u<<0)
#define MDF_OLD2CR_OLDEN_B_0X1          (0x1u<<0)

// OLD2THLR Configuration

#define MDF_OLD2THLR_OLDTHL             (0x3FFFFFFu<<0)
#define MDF_OLD2THLR_OLDTHL_0           (0x1u<<0)

// OLD2THHR Configuration

#define MDF_OLD2THHR_OLDTHH             (0x3FFFFFFu<<0)
#define MDF_OLD2THHR_OLDTHH_0           (0x1u<<0)

// DLY2CR Configuration

#define MDF_DLY2CR_SKPBF                (0x1u<<31)
#define MDF_DLY2CR_SKPDLY               (0x7Fu<<0)
#define MDF_DLY2CR_SKPDLY_0             (0x1u<<0)

#define MDF_DLY2CR_SKPBF_B_0X0          (0x0u<<31)
#define MDF_DLY2CR_SKPBF_B_0X1          (0x1u<<31)
#define MDF_DLY2CR_SKPDLY_B_0X0         (0x0u<<0)
#define MDF_DLY2CR_SKPDLY_B_0X1         (0x1u<<0)

// SCD2CR Configuration

#define MDF_SCD2CR_SCDACTIVE            (0x1u<<31)
#define MDF_SCD2CR_SCDT                 (0xFFu<<12)
#define MDF_SCD2CR_SCDT_0               (0x1u<<12)
#define MDF_SCD2CR_BKSCD                (0xFu<<4)
#define MDF_SCD2CR_BKSCD_0              (0x1u<<4)
#define MDF_SCD2CR_SCDEN                (0x1u<<0)

#define MDF_SCD2CR_SCDACTIVE_B_0X0      (0x0u<<31)
#define MDF_SCD2CR_SCDACTIVE_B_0X1      (0x1u<<31)
#define MDF_SCD2CR_SCDT_B_0X0           (0x0u<<12)
#define MDF_SCD2CR_SCDT_B_0X1           (0x1u<<12)
#define MDF_SCD2CR_SCDEN_B_0X0          (0x0u<<0)
#define MDF_SCD2CR_SCDEN_B_0X1          (0x1u<<0)

// DFLT2IER Configuration

#define MDF_DFLT2IER_RFOVRIE            (0x1u<<11)
#define MDF_DFLT2IER_CKABIE             (0x1u<<10)
#define MDF_DFLT2IER_SATIE              (0x1u<<9)
#define MDF_DFLT2IER_SCDIE              (0x1u<<8)
#define MDF_DFLT2IER_SSOVRIE            (0x1u<<7)
#define MDF_DFLT2IER_OLDIE              (0x1u<<4)
#define MDF_DFLT2IER_SSDRIE             (0x1u<<2)
#define MDF_DFLT2IER_DOVRIE             (0x1u<<1)
#define MDF_DFLT2IER_FTHIE              (0x1u<<0)

#define MDF_DFLT2IER_RFOVRIE_B_0X0      (0x0u<<11)
#define MDF_DFLT2IER_RFOVRIE_B_0X1      (0x1u<<11)
#define MDF_DFLT2IER_CKABIE_B_0X0       (0x0u<<10)
#define MDF_DFLT2IER_CKABIE_B_0X1       (0x1u<<10)
#define MDF_DFLT2IER_SATIE_B_0X0        (0x0u<<9)
#define MDF_DFLT2IER_SATIE_B_0X1        (0x1u<<9)
#define MDF_DFLT2IER_SCDIE_B_0X0        (0x0u<<8)
#define MDF_DFLT2IER_SCDIE_B_0X1        (0x1u<<8)
#define MDF_DFLT2IER_SSOVRIE_B_0X0      (0x0u<<7)
#define MDF_DFLT2IER_SSOVRIE_B_0X1      (0x1u<<7)
#define MDF_DFLT2IER_OLDIE_B_0X0        (0x0u<<4)
#define MDF_DFLT2IER_OLDIE_B_0X1        (0x1u<<4)
#define MDF_DFLT2IER_SSDRIE_B_0X0       (0x0u<<2)
#define MDF_DFLT2IER_SSDRIE_B_0X1       (0x1u<<2)
#define MDF_DFLT2IER_DOVRIE_B_0X0       (0x0u<<1)
#define MDF_DFLT2IER_DOVRIE_B_0X1       (0x1u<<1)
#define MDF_DFLT2IER_FTHIE_B_0X0        (0x0u<<0)
#define MDF_DFLT2IER_FTHIE_B_0X1        (0x1u<<0)

// DFLT2ISR Configuration

#define MDF_DFLT2ISR_RFOVRF             (0x1u<<11)
#define MDF_DFLT2ISR_CKABF              (0x1u<<10)
#define MDF_DFLT2ISR_SATF               (0x1u<<9)
#define MDF_DFLT2ISR_SCDF               (0x1u<<8)
#define MDF_DFLT2ISR_SSOVRF             (0x1u<<7)
#define MDF_DFLT2ISR_THHF               (0x1u<<6)
#define MDF_DFLT2ISR_THLF               (0x1u<<5)
#define MDF_DFLT2ISR_OLDF               (0x1u<<4)
#define MDF_DFLT2ISR_RXNEF              (0x1u<<3)
#define MDF_DFLT2ISR_SSDRF              (0x1u<<2)
#define MDF_DFLT2ISR_DOVRF              (0x1u<<1)
#define MDF_DFLT2ISR_FTHF               (0x1u<<0)

