Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_DFLT3RSFR_HPFC              (0x3u<<8)
#define MDF_DFLT3RSFR_HPFC_0            (0x1u<<8)
#define MDF_DFLT3RSFR_HPFBYP            (0x1u<<7)
#define MDF_DFLT3RSFR_RSFLTD            (0x1u<<4)
#define MDF_DFLT3RSFR_RSFLTBYP          (0x1u<<0)

#define MDF_DFLT3RSFR_HPFC_B_0X0        (0x0u<<8)
#define MDF_DFLT3RSFR_HPFC_B_0X1        (0x1u<<8)
#define MDF_DFLT3RSFR_HPFC_B_0X2        (0x2u<<8)
#define MDF_DFLT3RSFR_HPFC_B_0X3        (0x3u<<8)
#define MDF_DFLT3RSFR_HPFBYP_B_0X0      (0x0u<<7)
#define MDF_DFLT3RSFR_HPFBYP_B_0X1      (0x1u<<7)
#define MDF_DFLT3RSFR_RSFLTD_B_0X0      (0x0u<<4)
#define MDF_DFLT3RSFR_RSFLTD_B_0X1      (0x1u<<4)
#define MDF_DFLT3RSFR_RSFLTBYP_B_0X0    (0x0u<<0)
#define MDF_DFLT3RSFR_RSFLTBYP_B_0X1    (0x1u<<0)

// DFLT3INTR Configuration

#define MDF_DFLT3INTR_INTVAL            (0x7Fu<<4)
#define MDF_DFLT3INTR_INTVAL_0          (0x1u<<4)
#define MDF_DFLT3INTR_INTDIV            (0x3u<<0)
#define MDF_DFLT3INTR_INTDIV_0          (0x1u<<0)

#define MDF_DFLT3INTR_INTVAL_B_0X0      (0x0u<<4)
#define MDF_DFLT3INTR_INTVAL_B_0X1      (0x1u<<4)
#define MDF_DFLT3INTR_INTDIV_B_0X0      (0x0u<<0)
#define MDF_DFLT3INTR_INTDIV_B_0X1      (0x1u<<0)
#define MDF_DFLT3INTR_INTDIV_B_0X2      (0x2u<<0)
#define MDF_DFLT3INTR_INTDIV_B_0X3      (0x3u<<0)

// OLD3CR Configuration

#define MDF_OLD3CR_OLDACTIVE            (0x1u<<31)
#define MDF_OLD3CR_ACICD                (0x1Fu<<17)
#define MDF_OLD3CR_ACICD_0              (0x1u<<17)
#define MDF_OLD3CR_ACICN                (0x3u<<12)
#define MDF_OLD3CR_ACICN_0              (0x1u<<12)
#define MDF_OLD3CR_BKOLD                (0xFu<<4)
#define MDF_OLD3CR_BKOLD_0              (0x1u<<4)
#define MDF_OLD3CR_THINB                (0x1u<<1)
#define MDF_OLD3CR_OLDEN                (0x1u<<0)

#define MDF_OLD3CR_OLDACTIVE_B_0X0      (0x0u<<31)
#define MDF_OLD3CR_OLDACTIVE_B_0X1      (0x1u<<31)
#define MDF_OLD3CR_ACICD_B_0X0          (0x0u<<17)
#define MDF_OLD3CR_ACICD_B_0X1          (0x1u<<17)
#define MDF_OLD3CR_ACICN_B_0X0          (0x0u<<12)
#define MDF_OLD3CR_ACICN_B_0X1          (0x1u<<12)
#define MDF_OLD3CR_ACICN_B_0X2          (0x2u<<12)
#define MDF_OLD3CR_ACICN_B_0X3          (0x3u<<12)
#define MDF_OLD3CR_THINB_B_0X0          (0x0u<<1)
#define MDF_OLD3CR_THINB_B_0X1          (0x1u<<1)
#define MDF_OLD3CR_OLDEN_B_0X0          (0x0u<<0)
#define MDF_OLD3CR_OLDEN_B_0X1          (0x1u<<0)

// OLD3THLR Configuration

#define MDF_OLD3THLR_OLDTHL             (0x3FFFFFFu<<0)
#define MDF_OLD3THLR_OLDTHL_0           (0x1u<<0)

// OLD3THHR Configuration

#define MDF_OLD3THHR_OLDTHH             (0x3FFFFFFu<<0)
#define MDF_OLD3THHR_OLDTHH_0           (0x1u<<0)

// DLY3CR Configuration

#define MDF_DLY3CR_SKPBF                (0x1u<<31)
#define MDF_DLY3CR_SKPDLY               (0x7Fu<<0)
#define MDF_DLY3CR_SKPDLY_0             (0x1u<<0)

#define MDF_DLY3CR_SKPBF_B_0X0          (0x0u<<31)
#define MDF_DLY3CR_SKPBF_B_0X1          (0x1u<<31)
#define MDF_DLY3CR_SKPDLY_B_0X0         (0x0u<<0)
#define MDF_DLY3CR_SKPDLY_B_0X1         (0x1u<<0)

// SCD3CR Configuration

#define MDF_SCD3CR_SCDACTIVE            (0x1u<<31)
#define MDF_SCD3CR_SCDT                 (0xFFu<<12)
#define MDF_SCD3CR_SCDT_0               (0x1u<<12)
#define MDF_SCD3CR_BKSCD                (0xFu<<4)
#define MDF_SCD3CR_BKSCD_0              (0x1u<<4)
#define MDF_SCD3CR_SCDEN                (0x1u<<0)

#define MDF_SCD3CR_SCDACTIVE_B_0X0      (0x0u<<31)
#define MDF_SCD3CR_SCDACTIVE_B_0X1      (0x1u<<31)
#define MDF_SCD3CR_SCDT_B_0X0           (0x0u<<12)
#define MDF_SCD3CR_SCDT_B_0X1           (0x1u<<12)
#define MDF_SCD3CR_SCDEN_B_0X0          (0x0u<<0)
#define MDF_SCD3CR_SCDEN_B_0X1          (0x1u<<0)

// DFLT3IER Configuration

#define MDF_DFLT3IER_RFOVRIE            (0x1u<<11)
#define MDF_DFLT3IER_CKABIE             (0x1u<<10)
#define MDF_DFLT3IER_SATIE              (0x1u<<9)
#define MDF_DFLT3IER_SCDIE              (0x1u<<8)
#define MDF_DFLT3IER_SSOVRIE            (0x1u<<7)
#define MDF_DFLT3IER_OLDIE              (0x1u<<4)
#define MDF_DFLT3IER_SSDRIE             (0x1u<<2)
#define MDF_DFLT3IER_DOVRIE             (0x1u<<1)
#define MDF_DFLT3IER_FTHIE              (0x1u<<0)

#define MDF_DFLT3IER_RFOVRIE_B_0X0      (0x0u<<11)
#define MDF_DFLT3IER_RFOVRIE_B_0X1      (0x1u<<11)
#define MDF_DFLT3IER_CKABIE_B_0X0       (0x0u<<10)
#define MDF_DFLT3IER_CKABIE_B_0X1       (0x1u<<10)
#define MDF_DFLT3IER_SATIE_B_0X0        (0x0u<<9)
#define MDF_DFLT3IER_SATIE_B_0X1        (0x1u<<9)
#define MDF_DFLT3IER_SCDIE_B_0X0        (0x0u<<8)
#define MDF_DFLT3IER_SCDIE_B_0X1        (0x1u<<8)
#define MDF_DFLT3IER_SSOVRIE_B_0X0      (0x0u<<7)
#define MDF_DFLT3IER_SSOVRIE_B_0X1      (0x1u<<7)
#define MDF_DFLT3IER_OLDIE_B_0X0        (0x0u<<4)
#define MDF_DFLT3IER_OLDIE_B_0X1        (0x1u<<4)
#define MDF_DFLT3IER_SSDRIE_B_0X0       (0x0u<<2)
#define MDF_DFLT3IER_SSDRIE_B_0X1       (0x1u<<2)
#define MDF_DFLT3IER_DOVRIE_B_0X0       (0x0u<<1)
#define MDF_DFLT3IER_DOVRIE_B_0X1       (0x1u<<1)
#define MDF_DFLT3IER_FTHIE_B_0X0        (0x0u<<0)
#define MDF_DFLT3IER_FTHIE_B_0X1        (0x1u<<0)

// DFLT3ISR Configuration

#define MDF_DFLT3ISR_RFOVRF             (0x1u<<11)
#define MDF_DFLT3ISR_CKABF              (0x1u<<10)
#define MDF_DFLT3ISR_SATF               (0x1u<<9)
#define MDF_DFLT3ISR_SCDF               (0x1u<<8)
#define MDF_DFLT3ISR_SSOVRF             (0x1u<<7)
#define MDF_DFLT3ISR_THHF               (0x1u<<6)
#define MDF_DFLT3ISR_THLF               (0x1u<<5)
#define MDF_DFLT3ISR_OLDF               (0x1u<<4)
#define MDF_DFLT3ISR_RXNEF              (0x1u<<3)
#define MDF_DFLT3ISR_SSDRF              (0x1u<<2)
#define MDF_DFLT3ISR_DOVRF              (0x1u<<1)
#define MDF_DFLT3ISR_FTHF               (0x1u<<0)

#define MDF_DFLT3ISR_RFOVRF_B_0X0       (0x0u<<11)
#define MDF_DFLT3ISR_RFOVRF_B_0X1       (0x1u<<11)
#define MDF_DFLT3ISR_CKABF_B_0X0        (0x0u<<10)
#define MDF_DFLT3ISR_CKABF_B_0X1        (0x1u<<10)
#define MDF_DFLT3ISR_SATF_B_0X0         (0x0u<<9)
#define MDF_DFLT3ISR_SATF_B_0X1         (0x1u<<9)
#define MDF_DFLT3ISR_SCDF_B_0X0         (0x0u<<8)
#define MDF_DFLT3ISR_SCDF_B_0X1         (0x1u<<8)
#define MDF_DFLT3ISR_SSOVRF_B_0X0       (0x0u<<7)
#define MDF_DFLT3ISR_SSOVRF_B_0X1       (0x1u<<7)
#define MDF_DFLT3ISR_THHF_B_0X0         (0x0u<<6)
#define MDF_DFLT3ISR_THHF_B_0X1         (0x1u<<6)
#define MDF_DFLT3ISR_THLF_B_0X0         (0x0u<<5)
#define MDF_DFLT3ISR_THLF_B_0X1         (0x1u<<5)
#define MDF_DFLT3ISR_OLDF_B_0X0         (0x0u<<4)
#define MDF_DFLT3ISR_OLDF_B_0X1         (0x1u<<4)
#define MDF_DFLT3ISR_RXNEF_B_0X0        (0x0u<<3)
#define MDF_DFLT3ISR_RXNEF_B_0X1        (0x1u<<3)
#define MDF_DFLT3ISR_SSDRF_B_0X0        (0x0u<<2)
#define MDF_DFLT3ISR_SSDRF_B_0X1        (0x1u<<2)
#define MDF_DFLT3ISR_DOVRF_B_0X0        (0x0u<<1)
#define MDF_DFLT3ISR_DOVRF_B_0X1        (0x1u<<1)
#define MDF_DFLT3ISR_FTHF_B_0X0         (0x0u<<0)
#define MDF_DFLT3ISR_FTHF_B_0X1         (0x1u<<0)

