Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_DLY4CR_SKPBF_B_0X0          (0x0u<<31)
#define MDF_DLY4CR_SKPBF_B_0X1          (0x1u<<31)
#define MDF_DLY4CR_SKPDLY_B_0X0         (0x0u<<0)
#define MDF_DLY4CR_SKPDLY_B_0X1         (0x1u<<0)

// SCD4CR Configuration

#define MDF_SCD4CR_SCDACTIVE            (0x1u<<31)
#define MDF_SCD4CR_SCDT                 (0xFFu<<12)
#define MDF_SCD4CR_SCDT_0               (0x1u<<12)
#define MDF_SCD4CR_BKSCD                (0xFu<<4)
#define MDF_SCD4CR_BKSCD_0              (0x1u<<4)
#define MDF_SCD4CR_SCDEN                (0x1u<<0)

#define MDF_SCD4CR_SCDACTIVE_B_0X0      (0x0u<<31)
#define MDF_SCD4CR_SCDACTIVE_B_0X1      (0x1u<<31)
#define MDF_SCD4CR_SCDT_B_0X0           (0x0u<<12)
#define MDF_SCD4CR_SCDT_B_0X1           (0x1u<<12)
#define MDF_SCD4CR_SCDEN_B_0X0          (0x0u<<0)
#define MDF_SCD4CR_SCDEN_B_0X1          (0x1u<<0)

// DFLT4IER Configuration

#define MDF_DFLT4IER_RFOVRIE            (0x1u<<11)
#define MDF_DFLT4IER_CKABIE             (0x1u<<10)
#define MDF_DFLT4IER_SATIE              (0x1u<<9)
#define MDF_DFLT4IER_SCDIE              (0x1u<<8)
#define MDF_DFLT4IER_SSOVRIE            (0x1u<<7)
#define MDF_DFLT4IER_OLDIE              (0x1u<<4)
#define MDF_DFLT4IER_SSDRIE             (0x1u<<2)
#define MDF_DFLT4IER_DOVRIE             (0x1u<<1)
#define MDF_DFLT4IER_FTHIE              (0x1u<<0)

#define MDF_DFLT4IER_RFOVRIE_B_0X0      (0x0u<<11)
#define MDF_DFLT4IER_RFOVRIE_B_0X1      (0x1u<<11)
#define MDF_DFLT4IER_CKABIE_B_0X0       (0x0u<<10)
#define MDF_DFLT4IER_CKABIE_B_0X1       (0x1u<<10)
#define MDF_DFLT4IER_SATIE_B_0X0        (0x0u<<9)
#define MDF_DFLT4IER_SATIE_B_0X1        (0x1u<<9)
#define MDF_DFLT4IER_SCDIE_B_0X0        (0x0u<<8)
#define MDF_DFLT4IER_SCDIE_B_0X1        (0x1u<<8)
#define MDF_DFLT4IER_SSOVRIE_B_0X0      (0x0u<<7)
#define MDF_DFLT4IER_SSOVRIE_B_0X1      (0x1u<<7)
#define MDF_DFLT4IER_OLDIE_B_0X0        (0x0u<<4)
#define MDF_DFLT4IER_OLDIE_B_0X1        (0x1u<<4)
#define MDF_DFLT4IER_SSDRIE_B_0X0       (0x0u<<2)
#define MDF_DFLT4IER_SSDRIE_B_0X1       (0x1u<<2)
#define MDF_DFLT4IER_DOVRIE_B_0X0       (0x0u<<1)
#define MDF_DFLT4IER_DOVRIE_B_0X1       (0x1u<<1)
#define MDF_DFLT4IER_FTHIE_B_0X0        (0x0u<<0)
#define MDF_DFLT4IER_FTHIE_B_0X1        (0x1u<<0)

// DFLT4ISR Configuration

#define MDF_DFLT4ISR_RFOVRF             (0x1u<<11)
#define MDF_DFLT4ISR_CKABF              (0x1u<<10)
#define MDF_DFLT4ISR_SATF               (0x1u<<9)
#define MDF_DFLT4ISR_SCDF               (0x1u<<8)
#define MDF_DFLT4ISR_SSOVRF             (0x1u<<7)
#define MDF_DFLT4ISR_THHF               (0x1u<<6)
#define MDF_DFLT4ISR_THLF               (0x1u<<5)
#define MDF_DFLT4ISR_OLDF               (0x1u<<4)
#define MDF_DFLT4ISR_RXNEF              (0x1u<<3)
#define MDF_DFLT4ISR_SSDRF              (0x1u<<2)
#define MDF_DFLT4ISR_DOVRF              (0x1u<<1)
#define MDF_DFLT4ISR_FTHF               (0x1u<<0)

#define MDF_DFLT4ISR_RFOVRF_B_0X0       (0x0u<<11)
#define MDF_DFLT4ISR_RFOVRF_B_0X1       (0x1u<<11)
#define MDF_DFLT4ISR_CKABF_B_0X0        (0x0u<<10)
#define MDF_DFLT4ISR_CKABF_B_0X1        (0x1u<<10)
#define MDF_DFLT4ISR_SATF_B_0X0         (0x0u<<9)
#define MDF_DFLT4ISR_SATF_B_0X1         (0x1u<<9)
#define MDF_DFLT4ISR_SCDF_B_0X0         (0x0u<<8)
#define MDF_DFLT4ISR_SCDF_B_0X1         (0x1u<<8)
#define MDF_DFLT4ISR_SSOVRF_B_0X0       (0x0u<<7)
#define MDF_DFLT4ISR_SSOVRF_B_0X1       (0x1u<<7)
#define MDF_DFLT4ISR_THHF_B_0X0         (0x0u<<6)
#define MDF_DFLT4ISR_THHF_B_0X1         (0x1u<<6)
#define MDF_DFLT4ISR_THLF_B_0X0         (0x0u<<5)
#define MDF_DFLT4ISR_THLF_B_0X1         (0x1u<<5)
#define MDF_DFLT4ISR_OLDF_B_0X0         (0x0u<<4)
#define MDF_DFLT4ISR_OLDF_B_0X1         (0x1u<<4)
#define MDF_DFLT4ISR_RXNEF_B_0X0        (0x0u<<3)
#define MDF_DFLT4ISR_RXNEF_B_0X1        (0x1u<<3)
#define MDF_DFLT4ISR_SSDRF_B_0X0        (0x0u<<2)
#define MDF_DFLT4ISR_SSDRF_B_0X1        (0x1u<<2)
#define MDF_DFLT4ISR_DOVRF_B_0X0        (0x0u<<1)
#define MDF_DFLT4ISR_DOVRF_B_0X1        (0x1u<<1)
#define MDF_DFLT4ISR_FTHF_B_0X0         (0x0u<<0)
#define MDF_DFLT4ISR_FTHF_B_0X1         (0x1u<<0)

// OEC4CR Configuration

#define MDF_OEC4CR_OFFSET               (0x3FFFFFFu<<0)
#define MDF_OEC4CR_OFFSET_0             (0x1u<<0)

// SNPS4DR Configuration

#define MDF_SNPS4DR_SDR                 (0xFFFFu<<16)
#define MDF_SNPS4DR_SDR_0               (0x1u<<16)
#define MDF_SNPS4DR_EXTSDR              (0x7Fu<<9)
#define MDF_SNPS4DR_EXTSDR_0            (0x1u<<9)
#define MDF_SNPS4DR_MCICDC              (0x1FFu<<0)
#define MDF_SNPS4DR_MCICDC_0            (0x1u<<0)

// DFLT4DR Configuration

#define MDF_DFLT4DR_DR                  (0xFFFFFFu<<8)
#define MDF_DFLT4DR_DR_0                (0x1u<<8)

// SITF5CR Configuration

#define MDF_SITF5CR_SITFACTIVE          (0x1u<<31)
#define MDF_SITF5CR_STH                 (0x1Fu<<8)
#define MDF_SITF5CR_STH_0               (0x1u<<8)
#define MDF_SITF5CR_SITFMOD             (0x3u<<4)
#define MDF_SITF5CR_SITFMOD_0           (0x1u<<4)
#define MDF_SITF5CR_SCKSRC              (0x3u<<1)
#define MDF_SITF5CR_SCKSRC_0            (0x1u<<1)
#define MDF_SITF5CR_SITFEN              (0x1u<<0)

#define MDF_SITF5CR_SITFACTIVE_B_0X0    (0x0u<<31)
#define MDF_SITF5CR_SITFACTIVE_B_0X1    (0x1u<<31)
#define MDF_SITF5CR_SITFMOD_B_0X0       (0x0u<<4)
#define MDF_SITF5CR_SITFMOD_B_0X1       (0x1u<<4)
#define MDF_SITF5CR_SITFMOD_B_0X2       (0x2u<<4)
#define MDF_SITF5CR_SITFMOD_B_0X3       (0x3u<<4)
#define MDF_SITF5CR_SCKSRC_B_0X0        (0x0u<<1)
#define MDF_SITF5CR_SCKSRC_B_0X1        (0x1u<<1)
#define MDF_SITF5CR_SITFEN_B_0X0        (0x0u<<0)
#define MDF_SITF5CR_SITFEN_B_0X1        (0x1u<<0)

// BSMX5CR Configuration

#define MDF_BSMX5CR_BSMXACTIVE          (0x1u<<31)
#define MDF_BSMX5CR_BSSEL               (0x1Fu<<0)
#define MDF_BSMX5CR_BSSEL_0             (0x1u<<0)

#define MDF_BSMX5CR_BSMXACTIVE_B_0X0    (0x0u<<31)
#define MDF_BSMX5CR_BSMXACTIVE_B_0X1    (0x1u<<31)
#define MDF_BSMX5CR_BSSEL_B_0X0         (0x0u<<0)
#define MDF_BSMX5CR_BSSEL_B_0X1         (0x1u<<0)
#define MDF_BSMX5CR_BSSEL_B_0X2         (0x2u<<0)
#define MDF_BSMX5CR_BSSEL_B_0X3         (0x3u<<0)
#define MDF_BSMX5CR_BSSEL_B_0X1E        (0x1Eu<<0)
#define MDF_BSMX5CR_BSSEL_B_0X1F        (0x1Fu<<0)

