Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_mdf.h
#define MDF_OLD5THHR_OLDTHH             (0x3FFFFFFu<<0)
#define MDF_OLD5THHR_OLDTHH_0           (0x1u<<0)

// DLY5CR Configuration

#define MDF_DLY5CR_SKPBF                (0x1u<<31)
#define MDF_DLY5CR_SKPDLY               (0x7Fu<<0)
#define MDF_DLY5CR_SKPDLY_0             (0x1u<<0)

#define MDF_DLY5CR_SKPBF_B_0X0          (0x0u<<31)
#define MDF_DLY5CR_SKPBF_B_0X1          (0x1u<<31)
#define MDF_DLY5CR_SKPDLY_B_0X0         (0x0u<<0)
#define MDF_DLY5CR_SKPDLY_B_0X1         (0x1u<<0)

// SCD5CR Configuration

#define MDF_SCD5CR_SCDACTIVE            (0x1u<<31)
#define MDF_SCD5CR_SCDT                 (0xFFu<<12)
#define MDF_SCD5CR_SCDT_0               (0x1u<<12)
#define MDF_SCD5CR_BKSCD                (0xFu<<4)
#define MDF_SCD5CR_BKSCD_0              (0x1u<<4)
#define MDF_SCD5CR_SCDEN                (0x1u<<0)

#define MDF_SCD5CR_SCDACTIVE_B_0X0      (0x0u<<31)
#define MDF_SCD5CR_SCDACTIVE_B_0X1      (0x1u<<31)
#define MDF_SCD5CR_SCDT_B_0X0           (0x0u<<12)
#define MDF_SCD5CR_SCDT_B_0X1           (0x1u<<12)
#define MDF_SCD5CR_SCDEN_B_0X0          (0x0u<<0)
#define MDF_SCD5CR_SCDEN_B_0X1          (0x1u<<0)

// DFLT5IER Configuration

#define MDF_DFLT5IER_RFOVRIE            (0x1u<<11)
#define MDF_DFLT5IER_CKABIE             (0x1u<<10)
#define MDF_DFLT5IER_SATIE              (0x1u<<9)
#define MDF_DFLT5IER_SCDIE              (0x1u<<8)
#define MDF_DFLT5IER_SSOVRIE            (0x1u<<7)
#define MDF_DFLT5IER_OLDIE              (0x1u<<4)
#define MDF_DFLT5IER_SSDRIE             (0x1u<<2)
#define MDF_DFLT5IER_DOVRIE             (0x1u<<1)
#define MDF_DFLT5IER_FTHIE              (0x1u<<0)

#define MDF_DFLT5IER_RFOVRIE_B_0X0      (0x0u<<11)
#define MDF_DFLT5IER_RFOVRIE_B_0X1      (0x1u<<11)
#define MDF_DFLT5IER_CKABIE_B_0X0       (0x0u<<10)
#define MDF_DFLT5IER_CKABIE_B_0X1       (0x1u<<10)
#define MDF_DFLT5IER_SATIE_B_0X0        (0x0u<<9)
#define MDF_DFLT5IER_SATIE_B_0X1        (0x1u<<9)
#define MDF_DFLT5IER_SCDIE_B_0X0        (0x0u<<8)
#define MDF_DFLT5IER_SCDIE_B_0X1        (0x1u<<8)
#define MDF_DFLT5IER_SSOVRIE_B_0X0      (0x0u<<7)
#define MDF_DFLT5IER_SSOVRIE_B_0X1      (0x1u<<7)
#define MDF_DFLT5IER_OLDIE_B_0X0        (0x0u<<4)
#define MDF_DFLT5IER_OLDIE_B_0X1        (0x1u<<4)
#define MDF_DFLT5IER_SSDRIE_B_0X0       (0x0u<<2)
#define MDF_DFLT5IER_SSDRIE_B_0X1       (0x1u<<2)
#define MDF_DFLT5IER_DOVRIE_B_0X0       (0x0u<<1)
#define MDF_DFLT5IER_DOVRIE_B_0X1       (0x1u<<1)
#define MDF_DFLT5IER_FTHIE_B_0X0        (0x0u<<0)
#define MDF_DFLT5IER_FTHIE_B_0X1        (0x1u<<0)

// DFLT5ISR Configuration

#define MDF_DFLT5ISR_RFOVRF             (0x1u<<11)
#define MDF_DFLT5ISR_CKABF              (0x1u<<10)
#define MDF_DFLT5ISR_SATF               (0x1u<<9)
#define MDF_DFLT5ISR_SCDF               (0x1u<<8)
#define MDF_DFLT5ISR_SSOVRF             (0x1u<<7)
#define MDF_DFLT5ISR_THHF               (0x1u<<6)
#define MDF_DFLT5ISR_THLF               (0x1u<<5)
#define MDF_DFLT5ISR_OLDF               (0x1u<<4)
#define MDF_DFLT5ISR_RXNEF              (0x1u<<3)
#define MDF_DFLT5ISR_SSDRF              (0x1u<<2)
#define MDF_DFLT5ISR_DOVRF              (0x1u<<1)
#define MDF_DFLT5ISR_FTHF               (0x1u<<0)

#define MDF_DFLT5ISR_RFOVRF_B_0X0       (0x0u<<11)
#define MDF_DFLT5ISR_RFOVRF_B_0X1       (0x1u<<11)
#define MDF_DFLT5ISR_CKABF_B_0X0        (0x0u<<10)
#define MDF_DFLT5ISR_CKABF_B_0X1        (0x1u<<10)
#define MDF_DFLT5ISR_SATF_B_0X0         (0x0u<<9)
#define MDF_DFLT5ISR_SATF_B_0X1         (0x1u<<9)
#define MDF_DFLT5ISR_SCDF_B_0X0         (0x0u<<8)
#define MDF_DFLT5ISR_SCDF_B_0X1         (0x1u<<8)
#define MDF_DFLT5ISR_SSOVRF_B_0X0       (0x0u<<7)
#define MDF_DFLT5ISR_SSOVRF_B_0X1       (0x1u<<7)
#define MDF_DFLT5ISR_THHF_B_0X0         (0x0u<<6)
#define MDF_DFLT5ISR_THHF_B_0X1         (0x1u<<6)
#define MDF_DFLT5ISR_THLF_B_0X0         (0x0u<<5)
#define MDF_DFLT5ISR_THLF_B_0X1         (0x1u<<5)
#define MDF_DFLT5ISR_OLDF_B_0X0         (0x0u<<4)
#define MDF_DFLT5ISR_OLDF_B_0X1         (0x1u<<4)
#define MDF_DFLT5ISR_RXNEF_B_0X0        (0x0u<<3)
#define MDF_DFLT5ISR_RXNEF_B_0X1        (0x1u<<3)
#define MDF_DFLT5ISR_SSDRF_B_0X0        (0x0u<<2)
#define MDF_DFLT5ISR_SSDRF_B_0X1        (0x1u<<2)
#define MDF_DFLT5ISR_DOVRF_B_0X0        (0x0u<<1)
#define MDF_DFLT5ISR_DOVRF_B_0X1        (0x1u<<1)
#define MDF_DFLT5ISR_FTHF_B_0X0         (0x0u<<0)
#define MDF_DFLT5ISR_FTHF_B_0X1         (0x1u<<0)

// OEC5CR Configuration

#define MDF_OEC5CR_OFFSET               (0x3FFFFFFu<<0)
#define MDF_OEC5CR_OFFSET_0             (0x1u<<0)

// SNPS5DR Configuration

#define MDF_SNPS5DR_SDR                 (0xFFFFu<<16)
#define MDF_SNPS5DR_SDR_0               (0x1u<<16)
#define MDF_SNPS5DR_EXTSDR              (0x7Fu<<9)
#define MDF_SNPS5DR_EXTSDR_0            (0x1u<<9)
#define MDF_SNPS5DR_MCICDC              (0x1FFu<<0)
#define MDF_SNPS5DR_MCICDC_0            (0x1u<<0)

// DFLT5DR Configuration

#define MDF_DFLT5DR_DR                  (0xFFFFFFu<<8)
#define MDF_DFLT5DR_DR_0                (0x1u<<8)
